Autodesk.Revit.DB.View3D.CanToggleBetweenPerspectiveAndIsometricInternal
Checks whether this view can toggle between perspective and isometric.
Remarks:
If view contains view specific elements, ask to duplicate the view before toggling it.
Returns:
True if this view can be toggled, false otherwise.

Autodesk.Revit.DB.View3D.ToggleToIsometric
Toggles this view to isometric.
Remarks:
This view can only be toggled to isometric if no view specific elements are contained.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view cannot be toggled.
Since:
2015 Subscription Update

Autodesk.Revit.DB.View3D.ToggleToPerspective
Toggles this view to perspective.
Remarks:
This view can only be toggled to perspective if no view specific elements are contained.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view cannot be toggled.
Since:
2015 Subscription Update

Autodesk.Revit.DB.View3D.CanToggleBetweenPerspectiveAndIsometric
Checks whether this view can toggle between perspective and isometric.
Remarks:
This view can only be toggled if no view specific elements are contained.
Returns:
True if this view can be toggled, false otherwise.
Since:
2015 Subscription Update

Autodesk.Revit.DB.View3D.GetSectionBox
Gets a copy of the section box for this 3D view.
Remarks:
The section box cuts the model in this view by its boundaries.
Returns:
The section box.  Note that the section box can be rotated and transformed and thus you will need to use
Autodesk::Revit::DB::BoundingBoxXYZ::Transform to
interpret the coordinates of the corners or sides of the box in model coordinates.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.SetSectionBox(Autodesk.Revit.DB.BoundingBoxXYZ)
Sets the section box for this 3D view.
boundingBoxXYZ:
The bounding box to use for the section box.  To turn off the section box, set Autodesk.Revit.DB.View3D.IsSectionBoxActive to false.
Individual bound enabled flags in the input box are ignored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Bounding box cannot be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.Unlock
Unlocks the view. Has no effect if the view is already unlocked.
Since:
2013

Autodesk.Revit.DB.View3D.HasBeenLocked
Identifies if the view has ever been locked.
Since:
2013

Autodesk.Revit.DB.View3D.RestoreOrientationAndLock
Locks the view and restores its orientation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View has never been locked.
Since:
2013

Autodesk.Revit.DB.View3D.SaveOrientationAndLock
Locks the view and saves its orientation
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.
-or-
The orientation of the View3D cannot be saved.
Since:
2013

Autodesk.Revit.DB.View3D.CanSaveOrientation
Returns true if the View3D's orientation can be saved, false otherwise.
Remarks:
The saved orientation of the default 3D view cannot be overwritten. To convert the default 3D view into a normal 3D view, rename the default 3D view.
Returns:
True if the View3D's orientation can be saved, false otherwise.
Since:
2013

Autodesk.Revit.DB.View3D.SaveOrientation
Converts the temporary orientation of the View3D into its saved orientation.
Remarks:
The View3D will be oriented to its saved orientation on file open.
To save the orientation of the default View3D, first rename the default View3D.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The orientation of the View3D cannot be saved.
Since:
2013

Autodesk.Revit.DB.View3D.OrientTo(Autodesk.Revit.DB.XYZ)
Reorients the view to align with the forward direction.
Remarks:
This method adjusts the ViewOrientation to align with the input forward direction.
The eye position will be automatically determined based on the shape of the
viewing area and size of the model. The UpDirection will be aligned with the project Z axis.
forwardDirection:
The forward direction.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
forwardDirection has zero length.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is locked and cannot be reoriented.
Since:
2015

Autodesk.Revit.DB.View3D.SetOrientation(Autodesk.Revit.DB.ViewOrientation3D)
Sets the temporary orientation of the View3D.  The new orientation is not saved in the document.
newViewOrientation3D:
The new orientation to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View is locked and cannot be reoriented.
Since:
2013

Autodesk.Revit.DB.View3D.GetSavedOrientation
Gets the saved orientation of the View3D.
Returns:
The saved orientation of the View3D.
Since:
2013

Autodesk.Revit.DB.View3D.GetOrientation
Gets the current non-saved orientation of the View3D.
Returns:
The current non-saved orientation of the View3D.
Since:
2013

Autodesk.Revit.DB.View3D.CreatePerspective(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns a new perspective View3D.
Remarks:
The new View3D will receive a unique view name.  The view will be oriented in the same position as the default 3D view.
document:
The document to which the new View3D will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new View3D.  The type needs to be a ThreeDimensional ViewType.
Returns:
The new perspective View3D.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This View Family Type is not a ThreeDimensional view type.
-or-
3D view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.View3D.CreateIsometric(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns a new isometric View3D.
Remarks:
The new View3D will receive a unique view name.  The view will be oriented in the same position as the default 3D view.
document:
The document to which the new View3D will be added.
viewFamilyTypeId:
The id of the ViewFamilyType which will be used by the new View3D.  The type needs to be a ThreeDimensional ViewType.
Returns:
The new isometric View3D.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This View Family Type is not a ThreeDimensional view type.
-or-
3D view creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.View3D.ResetCameraTarget
Resets the camera target to the center of the field of view.
Remarks:
The camera target can only be reset for perspective view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The camera target cannot be reset for the view.
Since:
2015 Subscription Update

Autodesk.Revit.DB.View3D.CanResetCameraTarget
Checks whether the camera target can be reset for this view.
Remarks:
The camera target can only be reset for perspective view.
Returns:
True if camera target can be reset for this view, false otherwise.
Since:
2015 Subscription Update

Autodesk.Revit.DB.View3D.SetRenderingSettings(Autodesk.Revit.DB.RenderingSettings)
Changes the rendering settings for this 3d view.
settings:
The new rendering settings to be applied to this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View3D.GetRenderingSettings
Returns the current rendering settings for this 3d view.
Returns:
The returned object represents the current rendering settings.
If you change the returned object, you need to call SetRenderingSettings to apply the new settings back to Revit.
Since:
2013

Autodesk.Revit.DB.View3D.IsSectionBoxActive
Identifies whether or not the section box is active in this 3D view.
An active section box clips the geometry of the model in the 3D view.  This affects
the appearance of the view, and also will affect information returned from the API.  For example:
Elements outside the active section box will not be returned in the list of elements
obtained from Autodesk::Revit::DB::FilteredElementCollector when
this view is passed when contructing the collector.Elements clipped by the active section box will return clipped geometry
from Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options)
when this view is included in the options.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.IsPerspective
Identifies whether this is a perspective view.
Remarks:
In a perspective view, view direction is variable - it is the direction that connects a particular point on the model with the eye position.
The property Autodesk.Revit.DB.View.ViewDirection becomes less meaningful -
it only describes the general orientation of the camera.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.

Autodesk.Revit.DB.View3D.IsLocked
Indicates if the view is locked.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be a template view.
Since:
2013

Autodesk.Revit.DB.View3D
Class for 3D views